---
kind: property
id: P:Autodesk.Revit.DB.SunAndShadowSettings.RelativeToView
source: html/696386a4-6e66-3d6a-a55d-3873d0f66966.htm
---
# Autodesk.Revit.DB.SunAndShadowSettings.RelativeToView Property

Identifies whether the SunAndShadowSettings element is relative to the view
 direction. This is only relevant for lighting mode.

## Syntax (C#)
```csharp
public bool RelativeToView { get; set; }
```